app/views/shared/_user_number_links.html.erb

<span class="insults">
  <%= link_to pluralize(Insult.where(:insulter_id => user).count, "insult"), user_insults_path(user) %> |
---
SELECT COUNT(*) FROM "insults" WHERE "insults"."insulter_id" = 1