app/controllers/comments_controller.rb

  def index
    @insult = Insult.find_by_id(params[:insult_id])
    @comments = @insult.comments.paginate(:page => params[:page], :per_page => 10)
---
SELECT "insults".* FROM "insults" WHERE "insults"."id" = 1 ORDER BY insults.created_at DESC LIMIT 1
SELECT "comments".* FROM "comments" WHERE ("comments".insult_id = 1) LIMIT 10 OFFSET 0

  def create
    @insult = Insult.find_by_id(params[:insult_id])
    @comment = @insult.comments.build(:commenter_id => current_user.id,
                                      :content => params[:comment][:content])
    if @comment.save
---
SELECT "insults".* FROM "insults" WHERE "insults"."id" = 1 ORDER BY insults.created_at DESC LIMIT 1
INSERT INTO "comments" ("content", "commenter_id", "created_at", "updated_at", "insult_id") VALUES ('Suck it noobs', 1, '2014-08-20 20:15:56.015012', '2014-08-20 20:15:56.015012', 1) RETURNING "id"