app/controllers/daily_questions_controller.rb

SELECT "daily_questions".* FROM "daily_questions" ORDER BY daily_questions.created_at DESC LIMIT 1
---
  def index
    @daily_question = DailyQuestion.first

SELECT "daily_questions".* FROM "daily_questions" ORDER BY daily_questions.created_at DESC LIMIT 31 OFFSET 0
---
  def archive
    date = params[:timeframe].blank? ? nil : Time.parse(params[:timeframe])
    unless date.nil?
      @daily_questions = DailyQuestion.all(:conditions =>
                              { :created_at => date.beginning_of_month..date.end_of_month }).
			      paginate(:page => params[:page])