app/controllers/insults_controller.rb

  def create
    @insulted = User.find(params[:user_id])
    @insult = @insulted.insults.build(:insulter_id => current_user.id,
                                      :content => params[:insult][:content])
    if @insult.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
INSERT INTO "insults" ("content", "insulter_id", "insulted_id", "created_at", "updated_at") VALUES ('Everyone suck my balls', 1, 1, '2014-08-20 20:15:43.346999', '2014-08-20 20:15:43.346999') RETURNING "id"