app/controllers/pages_controller.rb

SELECT "users".* FROM "users" ORDER BY id DESC LIMIT 15
---
  def find_victim
    @title = "Make fun of a hater - Spotty Mouth Search"
    if params[:search].nil? || params[:search].blank?
      @newest_users = User.order("id DESC").limit(15)