app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
SELECT "insults".* FROM "insults" WHERE ("insults".insulted_id = 1) ORDER BY insults.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "insults" WHERE ("insults".insulted_id = 1)
SELECT "daily_questions".* FROM "daily_questions" ORDER BY daily_questions.created_at DESC LIMIT 1
---
  def show
    @user = User.find(params[:id])
    @insults = @user.insults.paginate(:page => params[:page])
    @insult = Insult.new
    @title = helpers.sanitize(@user.username, :tags => "")
    @daily_question = DailyQuestion.first

INSERT INTO "users" ("username", "email", "encrypted_password", "salt", "admin", "created_at", "updated_at", "image", "blurb") VALUES ('heezy', 'ealexhaywood@gmail.com', 'a0bed45195d45d757809325e9fd534d14a8fb48b21132548ff1af5c8aae4c117', '3c2ed21f920f60234caed4326f56f75a7f7843e913efc0cfe232063927ff08b7', 'f', '2014-08-20 20:14:38.055613', '2014-08-20 20:14:38.055613', NULL, NULL) RETURNING "id"
---
  def create
    @user = User.new(params[:user])
      if @user.valid? && verify_recaptcha()
	@user.save

UPDATE "users" SET "blurb" = 'Suck it everyone', "updated_at" = '2014-08-20 20:15:09.903648' WHERE "users"."id" = 1
---
  def update
    @user = current_user
    @user.image = params[:user][:image]
    begin
      @user.update_attributes!(params[:user])

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
SELECT * FROM "insults" WHERE ((insulter_id = 1 AND insulted_id = 1)
---
  def beef_with
    @user = User.find(params[:id])
    t = Insult.where("(insulter_id = :current_user AND insulted_id = :user)
                            OR (insulter_id = :user AND insulted_id = :current_user)",
                     { :current_user => current_user, :user => @user })