app/controllers/votes_controller.rb

  def vote_up_user
    @voted_on_user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

  def vote_down_user
    @voted_on_user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

  def vote_up_insult
    @voted_on_insult = Insult.find(params[:id])
---
SELECT "insults".* FROM "insults" WHERE "insults"."id" = 1 ORDER BY insults.created_at DESC LIMIT 1