app/views/insults/_insult.html.erb

 <% unless controller.controller_name == 'comments' %>
  <%= link_to "Comments(#{insult.comments.count})", insult_comments_path(insult),
						      :class => "comments_link" %>
---
SELECT COUNT(*) FROM "comments" WHERE ("comments".insult_id = 1)